---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.RepresentaionOf3DShapes
source: html/4149d79c-cbc1-37eb-0c5e-9d201ca569b4.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.RepresentaionOf3DShapes Property

Identifies how the Bending Detail will represent the 3D shapes.

## Syntax (C#)
```csharp
public BendingDetailFor3DShapesOptions RepresentaionOf3DShapes { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration